TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L2228/driverlib/empty_driverlib_src/ti/driverlib/dl_rtc_common.h
    return (DL_RTC_COMMON_PRESCALER1_DIVIDE)(prescaler);
}

/**
 *  @brief      Get prescaler 2 interrupt interval
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            Value for prescaler 2 interrupt interval
 *
 *  @retval            One of @ref DL_RTC_COMMON_PRESCALER2_DIVIDE
 */
__STATIC_INLINE DL_RTC_COMMON_PRESCALER2_DIVIDE DL_RTC_Common_getPrescaler2(
    RTC_Regs *rtc_common)
{
    uint32_t prescaler = (rtc_common->EXTPSCTL & RTC_EXTPSCTL_RT2PS_MASK);

    return (DL_RTC_COMMON_PRESCALER2_DIVIDE)(prescaler);
}

/**
 *  @brief      Get the seconds in BCD in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The seconds in the time stamp
 *
 *  @retval            Value in range: 0x0-0x59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampSecondsBCD(
    RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->TSSEC & (RTC_TSSEC_SECLOWBCD_MASK |
                                              RTC_TSSEC_SECHIGHBCD_MASK)) >>
                     RTC_TSSEC_SECLOWBCD_OFS);
}

/**
 *  @brief      Get the minutes in BCD in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The minutes in the time stamp
 *
 *  @retval            Value in range: 0x0-0x59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampMinutesBCD(
    RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->TSMIN & (RTC_TSMIN_MINLOWBCD_MASK |
                                              RTC_TSMIN_MINHIGHBCD_MASK)) >>
                     RTC_TSMIN_MINLOWBCD_OFS);
}

/**
 *  @brief      Get the hours in BCD in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The hours in the time stamp
 *
 *  @retval            Value in range: 0x0-0x23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampHoursBCD(
    RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->TSHOUR & (RTC_TSHOUR_HOURLOWBCD_MASK |
                                               RTC_TSHOUR_HOURHIGHBCD_MASK)) >>
                     RTC_TSHOUR_HOURLOWBCD_OFS);
}

/**
 *  @brief      Get the day of the week in BCD in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the week in the time stamp
 *
 *  @retval            Value in range: 0x0-0x6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampDayOfWeekBCD(
    RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->TSDAY & RTC_TSDAY_DOW_MASK);
}

/**
 *  @brief      Get the day of the month in BCD in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the month in the time stamp
 *
 *  @retval            Value in range: 0x1-0x31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampDayOfMonthBCD(
    RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->TSDAY & (RTC_TSDAY_DOMLOWBCD_MASK |
                                              RTC_TSDAY_DOMHIGHBCD_MASK)) >>
                     RTC_TSDAY_DOMLOWBCD_OFS);
}

/**
 *  @brief      Get the month of the year in BCD in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The month of the year in the time stamp
 *
 *  @retval            Value in range: 0x1-0x12
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampMonthBCD(
    RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->TSMON & (RTC_TSMON_MONLOWBCD_MASK |
                                              RTC_TSMON_MONHIGHBCD_MASK)) >>
                     RTC_TSMON_MONLOWBCD_OFS);
}

/**
 *  @brief      Get the year in BCD in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The year in the time stamp
 *
 *  @retval            Value in range: 0x0-0x4095
 *
 */
__STATIC_INLINE uint16_t DL_RTC_Common_getTimeStampYearBCD(
    RTC_Regs *rtc_common)
{
    return (uint16_t)(
        (rtc_common->TSYEAR &
            (RTC_TSYEAR_YERARLOWESTBCD_MASK | RTC_TSYEAR_DECADEBCD_MASK |
                RTC_TSYEAR_CENTLOWBCD_MASK | RTC_TSYEAR_CENTHIGHBCD_MASK)) >>
        RTC_TSYEAR_YERARLOWESTBCD_OFS);
}

/**
 *  @brief      Get the seconds in binary in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The seconds in the time stamp
 *  @retval            Value in range: 0-59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampSecondsBinary(
    RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->TSSEC & RTC_TSSEC_SECBIN_MASK);
}

/**
 *  @brief      Get the minutes in binary in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The minutes in the time stamp
 *
 *  @retval            Value in range: 0-59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampMinutesBinary(
    RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->TSMIN & RTC_TSMIN_MINBIN_MASK);
}

/**
 *  @brief      Get the hours in binary in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The hours in the time stamp
 *
 *  @retval            Value in range: 0-23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampHoursBinary(
    RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->TSHOUR & RTC_TSHOUR_HOURBIN_MASK);
}

/**
 *  @brief      Get the day of the week in binary in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the week in the time stamp
 *
 *  @retval            Value in range: 0-6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampDayOfWeekBinary(
    RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->TSDAY & RTC_TSDAY_DOW_MASK);
}

/**
 *  @brief      Get the day of the month in binary in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the month in the time stamp
 *
 *  @retval            Value in range: 1-31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampDayOfMonthBinary(
    RTC_Regs *rtc_common)
{
    return (uint8_t)(
        (rtc_common->TSDAY & RTC_TSDAY_DOMBIN_MASK) >> RTC_TSDAY_DOMBIN_OFS);
}

/**
 *  @brief      Get the month of the year in binary in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The month of the year in the time stamp
 *
 *  @retval            Value in range: 1-12
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getTimeStampMonthBinary(
    RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->TSMON & RTC_TSMON_MONBIN_MASK);
}

/**
 *  @brief      Get the year in binary in the time stamp
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The year in the time stamp
 *
 *  @retval            Value in range: 0-4095
 *
 */
__STATIC_INLINE uint16_t DL_RTC_Common_getTimeStampYearBinary(
    RTC_Regs *rtc_common)
{
    return (uint16_t)(rtc_common->TSYEAR & (RTC_TSYEAR_YEARLOWBIN_MASK |
                                               RTC_TSYEAR_YEARHIGHBIN_MASK));
}

/**
 *  @brief      Enable RTC Common interrupts
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Logical OR of
 *                             @ref DL_RTC_COMMON_INTERRUPT.
 */
__STATIC_INLINE void DL_RTC_Common_enableInterrupt(
    RTC_Regs *rtc_common, uint32_t interruptMask)
{
    rtc_common->CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable RTC Common interrupts
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Logical OR of
 *                             @ref DL_RTC_COMMON_INTERRUPT
 */
__STATIC_INLINE void DL_RTC_Common_disableInterrupt(
    RTC_Regs *rtc_common, uint32_t interruptMask)
{
    rtc_common->CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which RTC Common interrupts are enabled
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Logical OR of
 *                             @ref DL_RTC_COMMON_INTERRUPT
 *
 *  @return     Which of the requested RTC Common interrupts are enabled
 *
 *  @retval     Logical OR of @ref DL_RTC_COMMON_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_RTC_Common_getEnabledInterrupts(
    RTC_Regs *rtc_common, uint32_t interruptMask)
{
    return (rtc_common->CPU_INT.IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled RTC Common interrupts
 *
 *  Checks if any of the RTC Common interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Logical OR of
 *                             @ref DL_RTC_COMMON_INTERRUPT
 *
 *  @return     Which of the requested RTC Common interrupts are pending
 *
 *  @retval     Logical OR of @ref DL_RTC_COMMON_INTERRUPT values
 *
 *  @sa         DL_RTC_COMMON_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_RTC_Common_getEnabledInterruptStatus(
    RTC_Regs *rtc_common, uint32_t interruptMask)
{
    return (rtc_common->CPU_INT.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any RTC Common interrupt
 *
 *  Checks if any of the RTC Common interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Logical OR of
 *                             @ref DL_RTC_COMMON_INTERRUPT
 *
 *  @return     Which of the requested RTC Common interrupts are pending
 *
 *  @retval     Logical OR of @ref DL_RTC_COMMON_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_RTC_Common_getRawInterruptStatus(
    RTC_Regs *rtc_common, uint32_t interruptMask)
{
    return (rtc_common->CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending RTC Common interrupt
 *
 *  Checks if any of the RTC Common interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return     The highest priority pending RTC Common interrupt
 *
 *  @retval     One of @ref DL_RTC_COMMON_IIDX
 */
__STATIC_INLINE DL_RTC_COMMON_IIDX DL_RTC_Common_getPendingInterrupt(
    RTC_Regs *rtc_common)
{
    return (DL_RTC_COMMON_IIDX)(rtc_common->CPU_INT.IIDX);
}

/**
 *  @brief      Clear pending RTC Common interrupts
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Logical OR of
 *                             @ref DL_RTC_COMMON_INTERRUPT
 */
__STATIC_INLINE void DL_RTC_Common_clearInterruptStatus(
    RTC_Regs *rtc_common, uint32_t interruptMask)
{
    rtc_common->CPU_INT.ICLR = interruptMask;
}

/**
 *  @brief      Enable RTC Common event
 *
 *  @param[in]  rtc_common       Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to enable. Bitwise OR of
 *                          @ref DL_RTC_COMMON_EVENT.
 */
__STATIC_INLINE void DL_RTC_Common_enableEvent(
    RTC_Regs *rtc_common, uint32_t eventMask)
{
    rtc_common->GEN_EVENT.IMASK |= (eventMask);
}

/**
 *  @brief      Disable RTC Common event
 *
 *  @param[in]  rtc_common       Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to enable. Bitwise OR of
 *                          @ref DL_RTC_COMMON_EVENT.
 */
__STATIC_INLINE void DL_RTC_Common_disableEvent(
    RTC_Regs *rtc_common, uint32_t eventMask)
{
    rtc_common->GEN_EVENT.IMASK &= ~(eventMask);
}

/**
 *  @brief      Check which RTC Common events are enabled
 *
 *  @param[in]  rtc_common       Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to check. Bitwise OR of
 *                          @ref DL_RTC_COMMON_EVENT.
 *
 *  @return     Which of the requested RTC Common interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_RTC_COMMON_EVENT values
 */
__STATIC_INLINE uint32_t DL_RTC_Common_getEnabledEvents(
    RTC_Regs *rtc_common, uint32_t eventMask)
{
    return ((rtc_common->GEN_EVENT.IMASK) & (eventMask));
}

/**
 *  @brief      Check event flag of enabled RTC Common event
 *
 *  Checks if any of the RTC Common events that were previously enabled are
 *  pending.
 *
 *  @param[in]  rtc_common       Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to check. Bitwise OR of
 *                          @ref DL_RTC_COMMON_EVENT.
 *
 *  @return     Which of the requested RTC Common interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_RTC_COMMON_EVENT values
 *
 *  @sa         DL_RTC_COMMON_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_RTC_Common_getEnabledEventStatus(
    RTC_Regs *rtc_common, uint32_t eventMask)
{
    return ((rtc_common->GEN_EVENT.MIS) & eventMask);
}

/**
 *  @brief      Check interrupt flag of any RTC Common event
 *
 *  Checks if any events are pending. Events do not have to
 *  be previously enabled.
 *
 *  @param[in]  rtc_common       Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to check. Bitwise OR of
 *                          @ref DL_RTC_COMMON_EVENT.
 *
 *  @return     Which of the requested RTC Common interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_RTC_COMMON_EVENT values
 */
__STATIC_INLINE uint32_t DL_RTC_Common_getRawEventsStatus(
    RTC_Regs *rtc_common, uint32_t eventMask)
{
    return ((rtc_common->GEN_EVENT.RIS) & eventMask);
}

/**
 *  @brief      Clear pending RTC Common events
 *
 *  @param[in]  rtc_common       Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask   Bit mask of interrupts to clear. Bitwise OR of
 *                          @ref DL_RTC_COMMON_EVENT.
 */
__STATIC_INLINE void DL_RTC_Common_clearEventsStatus(
    RTC_Regs *rtc_common, uint32_t eventMask)
{
    rtc_common->GEN_EVENT.ICLR |= (eventMask);
}

/**
 *  @brief Sets the event publisher channel ID
 *
 *  @param[in]  rtc_common   Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      publisher is disconnected.
 */
__STATIC_INLINE void DL_RTC_Common_setPublisherChanID(
    RTC_Regs *rtc_common, uint8_t chanID)
{
    rtc_common->FPUB_0 = (chanID & RTC_FPUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event publisher channel ID
 *
 *  @param[in]  rtc_common Pointer to the register overlay for the
 *                  peripheral
 *
 *  @return     Event publisher channel ID
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getPublisherChanID(RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->FPUB_0 & RTC_FPUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief      Gets the cause of the time stamp event

